uhnp/src/InformationRegisters/тн_Интеграция_ЛогСообщений/тн_Интеграция_ЛогСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_Интеграция_ЛогСообщений</name>
  <comment>Выполнение задач № 000035594</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>XML_ПакетВходящий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>XML_ПакетИсходящий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>УниверсальнаяДатаВходящееСообщение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УниверсальнаяДатаИсходящееСообщение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСообщения</name>
    <type>
      <types>EnumRef.тн_ВидыСообщенийFinApp</types>
      <types>EnumRef.тн_ВидыСообщенийPortal</types>
      <types>EnumRef.тн_ВидыСообщений_ERP_УХ</types>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.тн_ВидыСобытийИнтеграции</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаРеспондентИД</name>
    <comment>Выполнение задач №000041384</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДСообщения</name>
    <comment>// Чекордина Ирина 10.12.2025 Выполнение задач №000056084</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидИнтеграции</name>
    <type>
      <types>EnumRef.тн_ВидыИнтеграций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ТН_Интеграция_НастройкиКлючаМаршрутизацииRMQ/ТН_Интеграция_НастройкиКлючаМаршрутизацииRMQ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТН_Интеграция_НастройкиКлючаМаршрутизацииRMQ</name>
  <comment>// Луконин Е.А. 01.09.2025 Выполнение задач №000054975</comment>
  <resources>
    <name>УдалятьСообщениеRMQПослеПодтвержденияОДоставке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазделениеПотоковОтправкиСообщенийПоПриоритетамТиповСообщений</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>КлючМаршрутизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/тн_ВидыСобытийИнтеграции/тн_ВидыСобытийИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>тн_ВидыСобытийИнтеграции</name>
  <comment>Выполнение задач №000035594</comment>
  <enumValues>
    <name>ПолученПакет</name>
  </enumValues>
  <enumValues>
    <name>ОтправленПакет</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаЗавершена</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>НачатоФормированиеПакета</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/тн_ВидыИнтеграций/тн_ВидыИнтеграций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>тн_ВидыИнтеграций</name>
  <comment>Выполнение задач №000035594</comment>
  <enumValues>
    <name>API</name>
  </enumValues>
  <enumValues>
    <name>API_Отправка</name>
  </enumValues>
  <enumValues>
    <name>Портал_Отправка</name>
    <comment>БИТ Тараскина М. 08.12.2015 Выполнение задач №000016981</comment>
  </enumValues>
  <enumValues>
    <name>Портал_Получение</name>
    <comment>БИТ Тараскина М. 08.12.2015 Выполнение задач №000016981</comment>
  </enumValues>
  <enumValues>
    <name>Обмены_Отправка</name>
  </enumValues>
  <enumValues>
    <name>International_Отправка</name>
    <comment>Абрамкин П.Ю. (БИТ) 14-07-2016 Выполнение задач 000021147</comment>
  </enumValues>
  <enumValues>
    <name>International_Получение</name>
    <comment>Абрамкин П.Ю. (БИТ) 14-07-2016 Выполнение задач 000021147</comment>
  </enumValues>
  <enumValues>
    <name>Zabbix</name>
    <comment>Соколов А. А. 16.12.2016 Выполнение задач 000023372</comment>
  </enumValues>
  <enumValues>
    <name>file_ws</name>
    <comment>//Кропачев 18.04.2017 ВЗ000024271</comment>
  </enumValues>
  <enumValues>
    <name>Сервис1СКонтрагент</name>
    <comment>// Калинин А. 22.05.2018 Выполнение задач №000028467</comment>
  </enumValues>
  <enumValues>
    <name>Обмены_Получение</name>
  </enumValues>
  <enumValues>
    <name>INFOR</name>
    <comment>Хохлов Владимир 27.08.2018 ВЗ №000029453</comment>
  </enumValues>
  <enumValues>
    <name>EWSServiceWS</name>
    <comment>Хохлов Владимир 2018-08-22 ВЗ №000029405</comment>
  </enumValues>
  <enumValues>
    <name>SQLIServiceWS</name>
    <comment>Хохлов Владимир 2018-08-22 ВЗ №000029405</comment>
  </enumValues>
  <enumValues>
    <name>EBS_WS</name>
    <comment>Хохлов Владимир 2018-08-23 ВЗ №000029405</comment>
  </enumValues>
  <enumValues>
    <name>FileService</name>
    <comment>// Луконин Е.А. 14.01.2020 Выполнение задач №000033749</comment>
  </enumValues>
  <enumValues>
    <name>FileShare</name>
    <comment>// Луконин Е.А. 14.01.2020 Выполнение задач №000033749</comment>
  </enumValues>
  <enumValues>
    <name>ОбменШПД</name>
    <comment>// Калинин А. 09.12.2019 Выполнение задач №000033580</comment>
  </enumValues>
  <enumValues>
    <name>RabbitMQ</name>
    <comment>// Калинин А. 09.12.2019 Выполнение задач №000033580</comment>
  </enumValues>
  <enumValues>
    <name>StockM</name>
    <comment>// Калинин А. 14.01.2020 Выполнение задач №000033888</comment>
  </enumValues>
  <enumValues>
    <name>ERP_УХ_Получение</name>
    <comment>Выполнение задач №000035594</comment>
  </enumValues>
  <enumValues>
    <name>ERP_УХ_Отправка</name>
  </enumValues>
  <enumValues>
    <name>finApp_Отправка</name>
    <comment>№000039664</comment>
  </enumValues>
  <enumValues>
    <name>finApp_Получение</name>
    <comment>№000039664</comment>
  </enumValues>
  <enumValues>
    <name>ОбменМеждуЦИС</name>
    <comment>// Одинец Роман 23.05.2024 Выполнение задач №000048970</comment>
  </enumValues>
  <enumValues>
    <name>TN_EDA</name>
    <comment>// Смирнов Д.А. 16.01.2025 Выполнение задач №000052291</comment>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/тн_ПрофилиПодключений/тн_ПрофилиПодключений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>тн_ПрофилиПодключений</name>
  <comment>Выполнение задач № 000035594</comment>
  <predefined>
    <items>
      <name>ИП1СКонтрагент</name>
      <description>1С:Контрагент (ИП)</description>
    </items>
    <items>
      <name>Доступность1СКонтрагент</name>
      <description>1С:Контрагент (проверка)</description>
    </items>
    <items>
      <name>Юрлицо1СКонтрагент</name>
      <description>1С:Контрагент (юрлицо)</description>
    </items>
    <items>
      <name>EBS_WS</name>
      <description>EBS WS</description>
    </items>
    <items>
      <name>EDA</name>
      <description>EDA</description>
    </items>
    <items>
      <name>ERP_УХ</name>
      <description>ERP УХ</description>
    </items>
    <items>
      <name>EWSServiceWS</name>
      <description>EWSService WS</description>
    </items>
    <items>
      <name>File_ws</name>
      <description>File ws</description>
    </items>
    <items>
      <name>RabbitMQ</name>
      <description>Rabbit MQ</description>
    </items>
    <items>
      <name>SQLIServiceWS</name>
      <description>SQLIService WS</description>
    </items>
    <items>
      <name>ЗУП</name>
      <description>ЗУП</description>
    </items>
    <items>
      <name>ОКС_Сбыт</name>
      <description>ОКС Сбыт</description>
    </items>
    <items>
      <name>Портал</name>
      <description>Портал</description>
    </items>
    <items>
      <name>УПП_Каркас</name>
      <description>УПП Каркас</description>
    </items>
    <items>
      <name>УПП_ЦБ</name>
      <description>УПП ЦБ</description>
    </items>
    <items>
      <name>ФинансовыйПомощник</name>
      <description>Финансовый помощник</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидИнтеграции</name>
    <type>
      <types>EnumRef.тн_ВидыИнтеграций</types>
    </type>
  </attributes>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Протокол</name>
    <type>
      <types>EnumRef.тн_ПротоколыПодключений</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Хост</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль_Удалить</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьАутентификациюОС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроксиСервер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Прокси_Протокол</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прокси_Хост</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прокси_Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прокси_Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прокси_Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прокси_ИспользоватьАутентификациюОС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРесурсаWSDL</name>
    <comment>// Калинин А. 22.05.2018 Выполнение задач №000028467</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВестиЛоги</name>
    <comment>// Калинин А. 22.05.2018 Выполнение задач №000028467</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ApiKey_Удалить</name>
    <comment>Навроцкий Иван 19.12.2018 Выполнение задач №000030714</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимПодключенияВнешнихКомпонент</name>
    <comment>Навроцкий Иван 19.12.2018 Выполнение задач №000030714</comment>
    <type>
      <types>EnumRef.тн_РежимыПодключенияВнешнихКомпонент</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверОчередейRMQ</name>
    <comment>// Калинин А. 02.10.2019 Выполнение задач №000033040</comment>
    <type>
      <types>CatalogRef.СерверыОчередейRMQ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколФайла</name>
    <comment>// Луконин Е.А. 14.01.2020 Выполнение задач №000033749</comment>
    <type>
      <types>EnumRef.тн_ВариантыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяОбъектомЦБ</name>
    <comment>// Луконин Е.А. 14.01.2020 Выполнение задач №000033749</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеПараметры</name>
    <comment>// Смирнов Д.А. 16.01.2025 Выполнение задач №000052291</comment>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Секрет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/CommonModules/тн_ИнтеграцияRMQ/Module.bsl
Процедура ПолучениеСообщенийRMQ(ТекстСообщенияJSON, СвойстваСообщения, ПодпискаНаОчередь, Отказ = Ложь, ВернутьВОчередь = Ложь) Экспорт
	
	Профиль = Справочники.тн_ПрофилиПодключений.RabbitMQ;
			
	ДанныеДляЛогирования = ПолучитьДанныеДляЛогирования(, , , Профиль.ВестиЛоги);
	
	// НАЧАЛО Хохлов Владимир 13.08.2020 ВЗ №000035546  
	// НАЧАЛО Гутарова Екатерина 16.05.2022 Выполнение задач №000041245
	//tn_message_format = Неопределено;
	//
	//Если СвойстваСообщения.Свойство("headers") И СвойстваСообщения.headers.Свойство("tn_message_format", tn_message_format) Тогда
	//	ТекстСообщенияJSON = ДобавитьЗаголовокСообщенияJSON(ТекстСообщенияJSON, tn_message_format);
	//КонецЕсли;  
	//
	tn_message_format = ПолучитьФорматСообщения(СвойстваСообщения);
		
	Если tn_message_format <> Неопределено Тогда
		ТекстСообщенияJSON = ДобавитьЗаголовокСообщенияJSON(ТекстСообщенияJSON, tn_message_format);
	КонецЕсли;
	// КОНЕЦ Гутарова Екатерина 16.05.2022 Выполнение задач №000041245
	// КОНЕЦ Хохлов Владимир 13.08.2020 ВЗ №000035546 
	
	ОписаниеОшибки = "";
	СообщениеXDTO = ПрочитатьСообщениеJSON(ТекстСообщенияJSON, ДанныеДляЛогирования, Отказ, ОписаниеОшибки);
	
	// НАЧАЛО Калинин А. 14.05.2020 Выполнение задач №000034897
	ВернутьВОчередьПринудительно = Ложь;
	// КОНЕЦ Калинин А. 14.05.2020 Выполнение задач №000034897
	
	Если Не Отказ Тогда
		
		URIПространстваИмен = СообщениеXDTO.Тип().URIПространстваИмен;

		// НАЧАЛО Борисенко Игорь 20.09.2022 Выполнение задач №000042666
		Если URIПространстваИмен = Метаданные.ПакетыXDTO.тн_Интеграция_ERP_УХ.ПространствоИмен Тогда
			// НАЧАЛО Борисенко Игорь 27.01.2024 Выполнение задач №000048249
			//тн_Интеграция_ERP_УХ.ПолучениеСообщенийRMQ(ТекстСообщенияJSON, СвойстваСообщения, ПодпискаНаОчередь, Отказ, ВернутьВОчередьПринудительно);
			тн_Интеграция_ERP_УХ.ПолучениеСообщенийRMQ(ТекстСообщенияJSON, СвойстваСообщения, ПодпискаНаОчередь, Отказ, ВернутьВОчередь);
			// КОНЕЦ Борисенко Игорь 27.01.2024 Выполнение задач №000048249
			
		// НАЧАЛО Одинец Роман 21.05.2024 Выполнение задач №000048970
		ИначеЕсли URIПространстваИмен = Метаданные.ПакетыXDTO.тн_ОбменМеждуЦИС.ПространствоИмен Тогда

			тн_ИнтеграцияОбменМеждуЦИС.ПолучениеСообщений(ТекстСообщенияJSON, СвойстваСообщения);
		// КОНЕЦ Одинец Роман 21.05.2024 Выполнение задач №000048970
			
		Иначе
			//неучтенный тип сообщения
			ЗаписатьЛогРаботы("Ошибка", ДанныеДляЛогирования, "Неучтенный формат сообщения. Общий модуль: тн_ИнтеграцияRMQ.ПолучениеСообщенийRMQ(). Тип сообщения: " + URIПространстваИмен);
			
			Отказ = Истина;
			
		КонецЕсли;
			
		// КОНЕЦ Борисенко Игорь 20.09.2022 Выполнение задач №000042666

		// НАЧАЛО Борисенко Игорь 20.09.2022 Выполнение задач №000042666
	//	// Борисенко И.Н. 23.07.2021 Выполнение задач №000035594: закомментировал
	//	Если Ложь Тогда
	//
	//	//Если URIПространстваИмен = Метаданные.ПакетыXDTO.тн_ОбменСообщениямиEBSMessage.ПространствоИмен Тогда
	//	//	//сообщение ШПД
	//	//	
	//	//	ОбработатьСообщениеШПД(СообщениеXDTO, ТекстСообщенияJSON, ДанныеДляЛогирования, Отказ);
	//	//	
	//	//ИначеЕсли URIПространстваИмен = Метаданные.ПакетыXDTO.тн_СервисСогласования.ПространствоИмен Тогда
	//	//	//сервис согласования
	//	//	
	//	//	тн_ИнтеграцияСервисСогласования.ПолучениеСообщенийОбменаСервисСогласования(ТекстСообщенияJSON, СвойстваСообщения, ПодпискаНаОчередь, Отказ, ВернутьВОчередьПринудительно);
	//	//	
	//	//ИначеЕсли URIПространстваИмен = Метаданные.ПакетыXDTO.TN_ExchangeEZUP_UPP.ПространствоИмен Тогда
	//	//	//ЕЗУП
	//	//	
	//	//	тн_ИнтеграцияЕЗУП3.ПолучениеСообщенийОбменаЕУЗП3_RMQ(ТекстСообщенияJSON, СвойстваСообщения, ПодпискаНаОчередь, Отказ, ВернутьВОчередьПринудительно);
	//	//	
	//	//ИначеЕсли URIПространстваИмен = Метаданные.ПакетыXDTO.TN_Integration.ПространствоИмен Тогда
	//	//	//TN integration
	//	//	
	//	//	тн_Интеграция_ОбщегоНазначения.ПолучениеСообщенийОбменаОКС_RMQ(ТекстСообщенияJSON, СвойстваСообщения, ПодпискаНаОчередь, Отказ, ВернутьВОчередьПринудительно);
	//	//	
	//	//// НАЧАЛО Калинин А. 04.02.2020 Выполнение задач №000034097
	//	//ИначеЕсли URIПространстваИмен = Метаданные.ПакетыXDTO.тн_API.ПространствоИмен Тогда
	//	//	//сообщение API
	//	//	
	//	//	ОбработатьСообщениеAPI(СообщениеXDTO, ТекстСообщенияJSON, Отказ);
	//	//// КОНЕЦ Калинин А. 04.02.2020 Выполнение задач №000034097
	//	//
	//	//// НАЧАЛО Хмелёв Сергей 21.04.2020 Выполнение задач №000034757	
	//	//ИначеЕсли URIПространстваИмен = Метаданные.ПакетыXDTO.TN_Exchange_Fi_Sec_OKS_FIN.ПространствоИмен Тогда
	//	//	//УЦБ
	//	//	
	//	//	тн_ИнтеграцияУЦБ.ПолучениеСообщенийОбменаУЦБ_RMQ(ТекстСообщенияJSON, СвойстваСообщения, ПодпискаНаОчередь, Отказ, ВернутьВОчередьПринудительно);
	//	//// КОНЕЦ  Хмелёв Сергей 21.04.2020 Выполнение задач №000034757
	//	//
	//	//// НАЧАЛО Калинин А. 18.05.2020 Выполнение задач №000034919
	//	//ИначеЕсли URIПространстваИмен = Метаданные.ПакетыXDTO.ИнтеграцияСПорталом.ПространствоИмен Тогда
	//	//	//портал
	//	//
	//	//	тн_ИнтеграцияСПорталом.ОбработатьСообщение(ТекстСообщенияJSON);
	//	//// КОНЕЦ Калинин А. 18.05.2020 Выполнение задач №000034919
	//	//
	//	//// НАЧАЛО Кудинов А.А. 22.05.2020 Выполнение задач №000034966 
	//	//ИначеЕсли URIПространстваИмен = Метаданные.ПакетыXDTO.СервисЗапросНаПлатёж.ПространствоИмен Тогда
	//	//	//портал
	//	//
	//	//	тн_ИнтеграцияСервисЗапросНаПлатёж.ОбработатьСообщение(СообщениеXDTO,ТекстСообщенияJSON,Отказ,ВернутьВОчередь);
	//	//// КОНЕЦ Кудинов А.А. 22.05.2020 Выполнение задач №000034966 
	//	//
	//	//// НАЧАЛО Плаксин Максим 13.08.2020 Выполнение задач №000035612
	//	//ИначеЕсли URIПространстваИмен = Метаданные.ПакетыXDTO.тн_ХранилищеQRКодов.ПространствоИмен Тогда
	//	//	// хранилище QR-кодов
	//	//	
	//	//	тн_ИнтеграцияХранилищеQRКодовПолныеПрава.ПолучениеСообщенийОбменаХранилищеQRКодов_RabbitMQ(ТекстСообщенияJSON, СвойстваСообщения, ПодпискаНаОчередь, Отказ, ВернутьВОчередьПринудительно);
	//	//	
	//	//// КОНЕЦ Плаксин Максим 13.08.2020 Выполнение задач №000035612	
	//	//
	//	//// НАЧАЛО Хохлов Владимир 13.08.2020 ВЗ №000035546
	//	//ИначеЕсли URIПространстваИмен = Метаданные.ПакетыXDTO.тн_IntegrationTicket.ПространствоИмен Тогда
	//	//	// Квиток о доставке сообщения
	//	//	
	//	//	ОбработатьIntegrationTicket(СообщениеXDTO, ТекстСообщенияJSON, Отказ, ВернутьВОчередь, ДанныеДляЛогирования);
	//	//
	//	//// КОНЕЦ Хохлов Владимир 13.08.2020 ВЗ №000035546 					
	//	
	//	Иначе
	//		//неучтенный тип сообщения
	//		// НАЧАЛО Борисенко Игорь 06.09.2022 Выполнение задач №000042522
	//		//ЗаписатьЛогРаботы("Ошибка", ДанныеДляЛогирования, "Неучтенный формат сообщения");
	//		ЗаписатьЛогРаботы("Ошибка", ДанныеДляЛогирования, "Неучтенный формат сообщения. Общий модуль: тн_ИнтеграцияRMQ.ПолучениеСообщенийRMQ(). Тип сообщения: " + URIПространстваИмен);
	//		// КОНЕЦ Борисенко Игорь 06.09.2022 Выполнение задач №000042522
	//		
	//		Отказ = Истина;
	//		
	//	КонецЕсли;
		// КОНЕЦ Борисенко Игорь 20.09.2022 Выполнение задач №000042666
	
	Иначе
		
		ЗаписатьЛогРаботы("Запрос", ДанныеДляЛогирования, ТекстСообщенияJSON, Перечисления.тн_ВидыСобытийИнтеграции.ПолученПакет);
		ЗаписатьЛогРаботы("Ошибка", ДанныеДляЛогирования, ОписаниеОшибки);
		
	КонецЕсли;
	
	// Борисенко И.Н. 23.07.2021 Выполнение задач №000035594: закомментировал
	
	//Если (Отказ И ОбщегоНазначения.ПолучитьЗначениеРеквизита(ПодпискаНаОчередь, "ВозвращатьСообщениеВОчередьПриОшибке")) Или ВернутьВОчередьПринудительно Тогда
	//	ВернутьВОчередь = Истина;
	//КонецЕсли;
	
КонецПроцедуры

Функция ПрочитатьСообщениеJSON(ТекстСообщенияJSON, ДанныеДляЛогирования, Отказ, ОписаниеОшибки)

	СообщениеXDTO = Неопределено;
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(ТекстСообщенияJSON);
	
	Попытка
		СообщениеXDTO = ФабрикаXDTO.ПрочитатьJSON(ЧтениеJSON);
	Исключение
		ОписаниеОшибки = "Ошибка при преобразовании содержимого ответа в ОбъектJSON:" + ОписаниеОшибки();
		Отказ = Истина;
	КонецПопытки;
	
	Возврат СообщениеXDTO;

КонецФункции

Функция ЗаписатьЛогРаботы(ВидЛога, ДанныеДляЛогирования, ОбъектЛогирования, Событие = "")
	
	ВидСообщения					= ДанныеДляЛогирования.ВидСообщения; 
	УникальныйИдентификаторЗапроса	= ДанныеДляЛогирования.ИдентификаторЗапроса;
	ИдентификаторИсточникаВызова	= ДанныеДляЛогирования.ИдентификаторИсточникаВызова;
	ВидИнтеграции					= ДанныеДляЛогирования.ВидИнтеграции;
	
	
	Если (ОбъектЛогирования <> Неопределено) 
	   И ЗначениеЗаполнено(ИдентификаторИсточникаВызова) Тогда 
	   		
		ТекстЛога = Строка(ИдентификаторИсточникаВызова) + Символы.ПС + Строка(ОбъектЛогирования);
		
	Иначе 
		
		ТекстЛога = ОбъектЛогирования;
		
	КонецЕсли;	
	
	Если ВидЛога = "Запрос" Тогда 
		
		Если ДанныеДляЛогирования.ВестиЛоги Тогда
				
			РегистрыСведений.тн_Интеграция_ЛогСообщений.ДобавитьЛогСообщенияВходящего(ВидИнтеграции, УникальныйИдентификаторЗапроса, ТекстЛога, ВидСообщения, Событие);

		КонецЕсли;  
			
	ИначеЕсли ВидЛога = "Ответ" Тогда 
		
		Если ДанныеДляЛогирования.ВестиЛоги Тогда
	
			РегистрыСведений.тн_Интеграция_ЛогСообщений.ДобавитьЛогСообщенияИсходящего(ВидИнтеграции, УникальныйИдентификаторЗапроса, ТекстЛога, ВидСообщения, Событие);

		КонецЕсли; 
			
	ИначеЕсли ВидЛога = "Ошибка" Тогда 
										
		РегистрыСведений.тн_Интеграция_ЛогСообщений.ДобавитьЛогОшибки(ВидИнтеграции, УникальныйИдентификаторЗапроса, Перечисления.тн_ВидыСобытийИнтеграции.Ошибка, ТекстЛога, ВидСообщения);								
				
	КонецЕсли;	
				
КонецФункции // ЗаписатьЛогРаботы()

Функция ПолучитьДанныеДляЛогирования(ВидСообщения = "", АдресЭлектроннойПочтыДляУведомленияОбОшибках = "", ИДИсточника = "", ВестиЛоги = Ложь)
	
	ДанныеДляЛогирования = Новый Структура;
	ДанныеДляЛогирования.Вставить("ВидСообщения", 									ВидСообщения);
	ДанныеДляЛогирования.Вставить("ИдентификаторЗапроса", 							Новый УникальныйИдентификатор);
	ДанныеДляЛогирования.Вставить("АдресЭлектроннойПочтыДляУведомленияОбОшибках",	АдресЭлектроннойПочтыДляУведомленияОбОшибках);
	ДанныеДляЛогирования.Вставить("ИдентификаторИсточникаВызова", 					ИДИсточника);
	ДанныеДляЛогирования.Вставить("ВестиЛоги", 										ВестиЛоги);
	ДанныеДляЛогирования.Вставить("ВидИнтеграции",									Перечисления.тн_ВидыИнтеграций.RabbitMQ);
	
	Возврат ДанныеДляЛогирования;
	
КонецФункции // ПолучитьДанныеДляЛогирования()

//Процедура ОбработатьСообщениеШПД(СообщениеXDTO, ТекстСообщенияJSON, ДанныеДляЛогирования, Отказ)

//	ИдентификаторСообщения = СообщениеXDTO.Заголовок.ИдентификаторСообщения;
//	
//	Если ЗначениеЗаполнено(ИдентификаторСообщения) И ИдентификаторСообщения <> "00000000-0000-0000-0000-000000000000" Тогда
//		
//		Попытка
//			ИдентификаторСообщения_УИД = Новый УникальныйИдентификатор(ИдентификаторСообщения);
//			ДанныеДляЛогирования.ИдентификаторЗапроса = ИдентификаторСообщения_УИД;
//		Исключение
//			//если переданный ключ сообщения не является гуидом, не используем его в качестве ключа записи
//		КонецПопытки;
//		
//	КонецЕсли;
//	
//	ДанныеДляЛогирования.ВидИнтеграции = Перечисления.тн_ВидыИнтеграций.ОбменШПД;
//	ЗаписатьЛогРаботы("Запрос", ДанныеДляЛогирования, ТекстСообщенияJSON, Перечисления.тн_ВидыСобытийИнтеграции.ПолученПакет);		
//	
//	ИдентификаторТекущейБазы = XMLСтрока(глЗначениеПеременной("ПроизводственноеПодразделение"));
//	
//	Если СообщениеXDTO.Заголовок.ИдентификаторЦелевойБазы = ИдентификаторТекущейБазы Тогда
//		
//		//сообщение предназначено данной базе, помещаем в очередь для обработки
//		Попытка
//			Ответ = тн_ОбменСообщениямиШПД.ДобавитьСообщениеВОчередьПолученных(СообщениеXDTO);
//			
//			Если Ответ <> "no" Тогда
//				ОписаниеОшибки = "Ошибка помещения сообщения ШПД в очередь: " + Ответ;
//				Отказ = Истина;
//			КонецЕсли;			
//			
//		Исключение
//			ОписаниеОшибки = "Ошибка помещения сообщения ШПД в очередь: " + ОписаниеОшибки();			
//			Отказ = Истина;
//		КонецПопытки;
//		
//	Иначе
//		
//		//сообщение предназначено другой базе
//		ОписаниеОшибки = "Переданный ИдентификаторЦелевойБазы не совпадает с идентификатором текущей базы";
//		Отказ = Истина;
//		
//	КонецЕсли;
//	
//	Если Не Отказ Тогда
//		ЗаписатьЛогРаботы("Ответ", ДанныеДляЛогирования, "Сообщение помещено в очередь для обработки", Перечисления.тн_ВидыСобытийИнтеграции.ОбработкаЗавершена);
//	Иначе
//		ЗаписатьЛогРаботы("Ошибка", ДанныеДляЛогирования, ОписаниеОшибки);
//	КонецЕсли;	

//КонецПроцедуры

//// Калинин А. 04.02.2020 Выполнение задач №000034097
//Процедура ОбработатьСообщениеAPI(СообщениеXDTO, ТекстСообщенияJSON, Отказ)

//	ИнформацияОВыполненииОперации = тн_API.ВыполнитьОбработкуПроизвольногоЗапросаAPI(ТекстСообщенияJSON,,,, СообщениеXDTO);
//	
//	Отказ = Не (ИнформацияОВыполненииОперации <> Неопределено И ИнформацияОВыполненииОперации.СтатусОтветаBizTalkServer = Перечисления.тн_СтатусыОтветаBizTalkServer.Успех);

//КонецПроцедуры

// Хохлов Владимир 13.08.2020 ВЗ №000035546
Функция ДобавитьЗаголовокСообщенияJSON(ТекстСообщенияJSON, tn_message_format)
	Если СтрНайти(tn_message_format, "integrationTicket") > 0 Тогда
		URIПростанстваИмен = "tn_IntegrationTicket";
		
	//НАЧАЛО Одинец Роман 22.05.2024 Выполнение задач №000048970
	ИначеЕсли СтрНайти(tn_message_format, "1cTo1c_") > 0 Тогда

		tn_message_format = СтрЗаменить(tn_message_format, "1cTo1c_", "");		
			
		Если Не ТН_ИнтеграцияПовтИсп.ПолучитьТипОбъектаXDTOПоИмени("tn_RTU", tn_message_format) = Неопределено Тогда
			URIПростанстваИмен = "tn_RTU";			
		Иначе     
			URIПростанстваИмен = "tn_ExchangeBetweenCentralizedIS";			      					
		КонецЕсли;
	// КОНЕЦ Одинец Роман 22.05.2024 Выполнение задач №000048970
		
	КонецЕсли; 
	
	Возврат "{
			|""#ns"": """ + URIПростанстваИмен + """,
			|""#type"": """ + tn_message_format + """,
			|""#value"": 
			|" + ТекстСообщенияJSON + "
			|}";
КонецФункции

// Хохлов Владимир 13.08.2020 ВЗ №000035546
Процедура ОбработатьIntegrationTicket(СообщениеXDTO, ТекстСообщенияJSON, Отказ, ВернутьВОчередь, ДанныеДляЛогирования)
	ЗаписатьЛогРаботы("Запрос", ДанныеДляЛогирования, ТекстСообщенияJSON, Перечисления.тн_ВидыСобытийИнтеграции.ПолученПакет);
	
	СообщениеСсылка = Справочники.ИсходящиеСообщения.ПолучитьСсылку(Новый УникальныйИдентификатор(СообщениеXDTO.messageGUID));
	СообщениеОбъект = СообщениеСсылка.ПолучитьОбъект();
	
	Если СообщениеОбъект = Неопределено Тогда
		ЗаписатьЛогРаботы("Ошибка", ДанныеДляЛогирования, "Не найдено сообщение с идентификатором """ + СообщениеXDTO.messageGUID + """.");
		
		Отказ = Истина;
		
		Возврат;
	КонецЕсли; 
	
	// НАЧАЛО Луконин Е.А. 01.09.2025 Выполнение задач №000054975
	//СообщениеОбъект.Доставлено = Истина;
	// КОНЕЦ Луконин Е.А. 01.09.2025 Выполнение задач №000054975
	
	Попытка
		// НАЧАЛО Луконин Е.А. 01.09.2025 Выполнение задач №000054975
		//СообщениеОбъект.Записать(); 
		УдалятьСообщениеRMQПослеПодтвержденияОДоставке = РегистрыСведений.ТН_Интеграция_НастройкиКлючаМаршрутизацииRMQ.ПолучитьЗначениеРесурса(СообщениеСсылка.КлючМаршрутизации, "УдалятьСообщениеRMQПослеПодтвержденияОДоставке", Ложь);
		Если УдалятьСообщениеRMQПослеПодтвержденияОДоставке Тогда
			СообщениеОбъект.Удалить();
		Иначе
			СообщениеОбъект.Доставлено = Истина;
			СообщениеОбъект.Записать();
		КонецЕсли;
		// КОНЕЦ Луконин Е.А. 01.09.2025 Выполнение задач №000054975
	Исключение
		ЗаписатьЛогРаботы("Ошибка", ДанныеДляЛогирования, "Ошибка записи сообщения с идентификатором """ + СообщениеXDTO.messageGUID + """: " + ОписаниеОшибки());
		
		Отказ = Истина;
		
		Возврат;
	КонецПопытки; 
	
	ЗаписатьЛогРаботы("Запрос", ДанныеДляЛогирования, ТекстСообщенияJSON, Перечисления.тн_ВидыСобытийИнтеграции.ОбработкаЗавершена);
КонецПроцедуры

// Гутарова Екатерина 16.05.2022 Выполнение задач №000041245
//
Функция ПолучитьФорматСообщения(СвойстваСообщения)
	
	tn_message_format = Неопределено;
	
	Если СвойстваСообщения = Неопределено Тогда
		Возврат tn_message_format;
	КонецЕсли;
		
	Если СвойстваСообщения.Свойство("headers") и СвойстваСообщения.headers.Свойство("tn_message_format") Тогда
		tn_message_format = СвойстваСообщения.headers.tn_message_format;
	КонецЕсли;   
	
	// НАЧАЛО Одинец Роман 26.06.2024 Выполнение задач №000048970
	Если СвойстваСообщения.Свойство("Заголовки") Тогда
		tn_message_format = СвойстваСообщения.Заголовки.Получить("tn_message_format");
	КонецЕсли; 
	// КОНЕЦ Одинец Роман 26.06.2024 Выполнение задач №000048970
	
	Если tn_message_format = Неопределено И СвойстваСообщения.Свойство("Тип") Тогда
		ТипСообщения = НРег(СвойстваСообщения.Тип);
		Если СтрНайти(ТипСообщения, "finappto1c_") > 0 Тогда
			tn_message_format = ТипСообщения;
		ИначеЕсли СтрНайти(ТипСообщения, "portalto1c_") > 0 Тогда
			tn_message_format = ТипСообщения;		

		// НАЧАЛО Одинец Роман 07.05.2024 Выполнение задач №000048970
		ИначеЕсли СтрНайти(ТипСообщения, "1cTo1c") > 0 Тогда
			tn_message_format = ТипСообщения;
		// КОНЕЦ Одинец Роман 07.05.2024 Выполнение задач №000048970

		КонецЕсли;  
	КонецЕсли;  	
	
	Возврат tn_message_format;
	
КонецФункции // ПолучитьФорматСообщения()   

// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
//
Функция ВремяОжиданияОтветаОтЗапросыRabbitMQ() Экспорт

	Результат = Константы.тн_ВремяОжиданияОтветаОтЗапросыRabbitMQ.Получить();
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = 60; 
	КонецЕсли;
	
	Возврат Результат;

КонецФункции
